% 実習日： **/**/**
% グループ名：****

%% data3, weight: 50g, 1step <- データ番号，実験条件などに書き換える
%データの読み込み
load('test_data/test171211/mydata_11.mat'); %ファイル名を書き換える

%生データの確認
figure, plot(captureData(:,1), captureData(:,2)-captureData(1,2));

%生データからスパイクの域値を決める．
threshold = 15; %[40, 100] のように書くと 40-100 の間にあるピークを検出
weight = '100+100'; %実験条件．おもりの重さなど文字列で入れる

fit_range = [1, 20; 32, 52]; %histgram を exponential で fit する場合は範囲を入れる

%データの表示
PlotHist2(threshold, 1, weight, fit_range);

%% 刺激応答曲線にプロットしたデータを入れる

%1step [] 中に重りの重さ，最大発火頻度の数値を記載
%荷重
w1 = [50, 5, 10, 20, 100, 300, 50, 50, 50, 50, 50, 50, 50, 200, 200, 200, 200];
%最大発火頻度
maxFR1 = [560, 10, 150, 160, 370, 640, 350, 480, 340, 420, 490, 660, 90, 350, 300, 210, 220];

%同じ条件は平均に変更
m50 = mean([560, 350, 480, 340, 420, 490, 660, 90]);
m200 = mean([350, 300, 210, 220]);
w1m = [5, 10, 20, 50, 100, 200, 300];
maxFR1m = [10, 150, 160, m50, 370, m200, 640];

%2step []
w2 = [205, 210, 220, 250, 300, 400, 500]; %合計の荷重
maxFR2 = [30, 80, 150, 250, 350, 500, 600]; %2回目の刺激時の最大発火頻度


PlotWeightResp(w1m, maxFR1m, w2, maxFR2)
%%
w3 = [205, 210, 220, 250, 300];
maxFR3 = [20, 130, 120, 130, 90];

figure;
semilogx(w1m, maxFR1m, 'ko');
hold on
semilogx(w2, maxFR2, 'xr');
semilogx(w3, maxFR3, '+b');
hold off


